In [2]:
import pandas as pd
import sqlite3 as sql

In [3]:
db = sql.connect("newdb.db")
cursor = db.cursor()

In [5]:
df = pd.read_csv("https://raw.githubusercontent.com/muzaffar-murodovich/data-science-and-ai/refs/heads/master/data-science/data-processing/xlsx2csv.csv", index_col=0)
df.head()

  First Name  Last Name  Gender        Country  Age        Date    Id
0
1      Dulce      Abril  Female  United States   32  15/10/2017  1562
2       Mara  Hashimoto  Female  Great Britain   25  16/08/2016  1582
3     Philip       Gent    Male         France   36  21/05/2015  2587
4   Kathleen     Hanner  Female  United States   25  15/10/2017  3549
5    Nereida    Magwood  Female  United States   58  16/08/2016  2468

In [6]:
new_cols = ['firstname', 'lastname', 'gender', 'country', 'age', 'date', 'id']
df.columns = new_cols
df.head()

  firstname   lastname  gender        country  age        date    id
0
1     Dulce      Abril  Female  United States   32  15/10/2017  1562
2      Mara  Hashimoto  Female  Great Britain   25  16/08/2016  1582
3    Philip       Gent    Male         France   36  21/05/2015  2587
4  Kathleen     Hanner  Female  United States   25  15/10/2017  3549
5   Nereida    Magwood  Female  United States   58  16/08/2016  2468

In [13]:
df.to_sql('ppl', db)

50

In [23]:
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
cursor.fetchall()

[('ppl',)]

In [24]:
cursor.execute("PRAGMA table_info(ppl);")
cursor.fetchall()

[(0, '0', 'INTEGER', 0, None, 0),
 (1, 'firstname', 'TEXT', 0, None, 0),
 (2, 'lastname', 'TEXT', 0, None, 0),
 (3, 'gender', 'TEXT', 0, None, 0),
 (4, 'country', 'TEXT', 0, None, 0),
 (5, 'age', 'INTEGER', 0, None, 0),
 (6, 'date', 'TEXT', 0, None, 0),
 (7, 'id', 'INTEGER', 0, None, 0)]